
&НаСервереБезКонтекста
Функция ОсновныеНачисленияПриИзмененииНаСервере(Дата, Сотрудник, Подразделение, ВидНачисления)
	
	//если выбран вид начисления Оклад, подставить автоматически размер оклада
	Если ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда		
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("Сотрудник", Сотрудник);
		СтруктураОтбор.Вставить("Подразделение", Подразделение);
		
		Оклад = РегистрыСведений.ОкладыСотрудников.ПолучитьПоследнее(Дата, СтруктураОтбор).Оклад;
		
		Возврат Оклад;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОсновныеНачисленияПриИзменении(Элемент) 
	ТекСтрока = Элементы.ОсновныеНачисления.ТекущиеДанные;                    

	ТекСтрока.Размер = ОсновныеНачисленияПриИзмененииНаСервере(Объект.Дата, ТекСтрока.Сотрудник, Объект.Подразделение, ТекСтрока.ВидНачисления);		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнительныеНачисленияВидНачисленияПриИзмененииНаСервере(ВидНачисления)
	Возврат ВидНачисления = ПланыВидовРасчета.ДополнительныеНачисления.Подарок;	
КонецФункции

&НаКлиенте
Процедура ДополнительныеНачисленияВидНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.ДополнительныеНачисления.ТекущиеДанные; 
	
	ВидНачисленияПодарок = ДополнительныеНачисленияВидНачисленияПриИзмененииНаСервере(ТекСтрока.ВидНачисления);
	
	//если вид начисления подарок - сделать невидимой колонку "Процент" 
	//иначе невидима колонка "Размер
	
	Если ВидНачисленияПодарок Тогда
		
		Элементы.ДополнительныеНачисленияПроцент.Доступность = Ложь;
		Элементы.ДополнительныеНачисленияРазмер.Доступность = Истина;  
		
	Иначе
		Элементы.ДополнительныеНачисленияРазмер.Доступность = Ложь;
		Элементы.ДополнительныеНачисленияПроцент.Доступность = Истина;
		
	КонецЕсли;		
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНДФЛНаСервере()	
	
	//В Удержания внести имена всех сотрудников, у кого есть основные и/или дополнительные начисления за текущий месяц
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НачислениеЗарплатыДополнительныеНачисления.Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.ДополнительныеНачисления КАК НачислениеЗарплатыДополнительныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыДополнительныеНачисления.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 		
		НоваяСтрока = Объект.Удержания.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник; 
		НоваяСтрока.ВидНачисления = ПланыВидовРасчета.Удержания.НДФЛ; 
		НоваяСтрока.Процент = 13;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНДФЛ(Команда) 
	Записать();
	ЗаполнитьНДФЛНаСервере(); 
КонецПроцедуры 


&НаСервереБезКонтекста
Функция УдержанияВидНачисленияПриИзмененииНаСервере(ВидНачисления)
	Если ВидНачисления = ПланыВидовРасчета.Удержания.НДФЛ Тогда  
		Возврат 13;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УдержанияВидНачисленияПриИзменении(Элемент)
	ТекСтрока = Элементы.Удержания.ТекущиеДанные;
	
	ТекСтрока.Процент = УдержанияВидНачисленияПриИзмененииНаСервере(ТекСтрока.ВидНачисления);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОсн(Команда)
	// Очищаем табличную часть 
	Объект.ОсновныеНачисления.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДоп(Команда)
	Объект.ДополнительныеНачисления.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУдержания(Команда)
	Объект.Удержания.Очистить();
КонецПроцедуры
