&НаКлиенте
Процедура ТоварыЦенаКоличествоПриИзменении(Элемент)
ТекСтрока = Элементы.Товары.ТекущиеДанные;

ТекСтрока.Стоимость = ТекСтрока.Количество * ТекСтрока.ЦенаРеализации;

КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекСтрока.ЦенаРеализации = РасчетныеПроцедурыСервер.НайтиЦену(КонецДня(Объект.Дата), ТекСтрока.Номенклатура,Объект.ВидЦены, Объект.Валюта);
    ТекСтрока.Стоимость = ТекСтрока.Количество * ТекСтрока.ЦенаРеализации;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	// Очищаем табличную часть 
	Объект.Товары.Очистить();
КонецПроцедуры
