
Процедура ЗагрузитьТовары(ПутьКФайлу, Контрагент, Создать) экспорт
	
	//Создать документ, содержащий в табличной части список товарок из загружаемого файла 
	Если Создать = "Поступление товаров" Тогда
		НовыйДок = Документы.ПоступлениеТоваров.СоздатьДокумент(); 
		НовыйДок.Поставщик = Контрагент;      
	ИначеЕсли Создать = "Реализация товаров" Тогда
		НовыйДок = Документы.РеализацияТоваров.СоздатьДокумент(); 
		НовыйДок.Покупатель = Контрагент;  
	Иначе 
		Сообщить("Укажите какой документ необходимо создать!");
		Возврат;		
	КонецЕсли; 
		
		НовыйДок.Дата = ТекущаяДата();
		

		
	//Получить текстовый документ
	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(ПутьКФайлу);
	
	//Построчный обход текстового документа
	Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		
		//Получить строку документа
		СтрокаДокумента = Документ.ПолучитьСтроку(НомерСтроки);  
		
		//Разложим в массив каждое значение, разделенное ";"
		МассивЗначенийСтроки = СтрРазделить(СтрокаДокумента, ";");    
		
		//Получить значения массива
		НаименованиеТовара        = МассивЗначенийСтроки[0]; 
		КоличествоТовара          = МассивЗначенийСтроки[1]; 
		ЦенаТовара                = МассивЗначенийСтроки[2]; 
		СтоимостьТовара           = МассивЗначенийСтроки[3];
		
		
		//Проверяем есть ли уже в справочнике "Номенклатура" Товар с таким наименованием
		Товар = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеТовара, Истина);
		//если нет - создать
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			
			//Создать элемент
			Товар = Справочники.Номенклатура.СоздатьЭлемент();
			
			Товар.Наименование = НаименованиеТовара;    
			
			Товар.Записать();	
			
		КонецЕсли;	
		
		//записать товары в табличную часть документа  
		НоваяСтрокаДок = НовыйДок.Товары.Добавить(); 
		
		Если Создать = "Поступление товаров" Тогда			
			НоваяСтрокаДок.ЦенаЗакупочная = ЦенаТовара; 
			
		ИначеЕсли Создать = "Реализация товаров" Тогда
			НоваяСтрокаДок.ЦенаРеализации = ЦенаТовара; 
			
		КонецЕсли; 
		
		НоваяСтрокаДок.Номенклатура = Товар.Ссылка;
		НоваяСтрокаДок.Количество   = КоличествоТовара;
		НоваяСтрокаДок.Стоимость = СтоимостьТовара;
	КонецЦикла;

	//НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	НовыйДок.Записать(); //без проведения
	Сообщить("Товар загружен в документ " + НовыйДок.Ссылка);
	
КонецПроцедуры
