
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		// Заполнение шапки
		//СчетПоступления = 0;
		Валюта = ДанныеЗаполнения.Валюта;
		Сумма = ДанныеЗаполнения.ИтоговаяСумма;
		Покупатель = ДанныеЗаполнения.Покупатель;       
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	//проверить соответствует ли валюта счета валюте, указанной в документе-основании
	Если  СчетПоступления.ВалютаСчета <> Валюта Тогда
		Сообщить("Валюта счёта не соответствует валюте, указанной в документе-основании. 
					| Выберите счёт поступления для валюты " + Валюта);
	
		Отказ = Истина;	
	КонецЕсли;	 
	
		
	//Узнать курс указанной в документе валюты. Вызов общего модуля
	КурсВалюты = РасчетныеПроцедурыСервер.ОпределитьКурс(Дата, Валюта);  	
	Если КурсВалюты = 0 Тогда		
		Сообщить("Курс " + Валюта + " не задан!"); 
		//отказаться от проведения документа и выйти из процедуры
		Отказ = Истина;
		Возврат;			
	КонецЕсли;
	
	Движения.Хозрасчетный.Записывать = Истина; 
	
	// регистр Хозрасчетный   		
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.Период = Дата;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СчетаОрганизации] = СчетПоступления;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;    
	
	Если Валюта <> Справочники.Валюты.Рубль Тогда			
		
		//если счет в валюте и задан курс валюты
		//Дт52 - Кт62.01 
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
		Движение.ВалютаДт = Валюта;
		Движение.Сумма = Сумма * КурсВалюты;
		Движение.ВалютнаяСуммаДт = Сумма;
	Иначе
		// если Валюта = Рубль   
		//Дт51 - Кт62.01
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
		Движение.Сумма = Сумма;
		
	КонецЕсли;
	
КонецПроцедуры
