
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите CSV файл'")
	+ "(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите CSV файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда		
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	ЗагрузкиИзВнешнихИсточниковСервер.ЗагрузитьТовары(Объект.ПутьКФайлу, Контрагент, Создать);
КонецПроцедуры
