
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьКурсыВалют();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют ()  
	
	//Сервер
	Сервер = "cbrates.rbc.ru";  
	
	Попытка
		HTTP = Новый HTTPСоединение(Сервер);
	Исключение
		Сообщить("Не удалось подключиться");
		Возврат;
	КонецПопытки;
	
	//Создать документ, куда будет записываться полученная информация
	НовыйДок = Документы.УстановкаКурсовВалют.СоздатьДокумент();  
	НовыйДок.Дата = ТекущаяДата();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Код КАК Код,
		|	Валюты.Ссылка КАК ВалютаСсылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		Если ВыборкаДетальныеЗаписи.Код <> "643" Тогда
			//если валюта не рубль
			//определяем курс по коду валюты на текущую дату 
			Год = СтрЗаменить(Год(ТекущаяДата()), Символы.НПП, "");
			Месяц = Месяц(ТекущаяДата());
			День = День(ТекущаяДата());
			Дата = "/" + Год + "/" + Месяц + "/" + День;
			
			Адрес = "tsv/" + ВыборкаДетальныеЗаписи.Код + Дата + ".tsv";
			
			HTTPЗапрос = Новый HTTPЗапрос(Адрес); 
			HTTPОтвет = HTTP.Получить(HTTPЗапрос);
			Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");
			
			Для ИндексСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
				
				СтрокаКурса = СтрПолучитьСтроку(Текст, ИндексСтроки);
				//Распарсить строку с курсом по символу табуляции
				МногострочнаяСтрока = СтрЗаменить(СтрокаКурса, "	", Символы.ПС);
				//значение курса валюты
				Курс = СтрПолучитьСтроку(МногострочнаяСтрока, 2); 
				
				//Добавить запись о курсе валюты в документ "Установка курсов валют" 
				НоваяСтрока = НовыйДок.КурсыВалют.Добавить();
				
				НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.ВалютаСсылка;
				НоваяСтрока.Курс   = Курс; 
				
			КонецЦикла;	 
		КонецЕсли;   
		
	КонецЦикла; 
	
	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	//НовыйДок.Записать(); //без проведения
	Сообщить("Курс валют загружен! Создан документ: " + НовыйДок.Ссылка);
КонецПроцедуры
